---
kind: enumMember
id: F:Autodesk.Revit.DB.Architecture.RailExtensionStyle.Wall
enum: Autodesk.Revit.DB.Architecture.RailExtensionStyle
zh: 墙、墙体
source: html/04ad8fa3-fd3b-33a5-e19a-75447ec3b1a4.htm
---
# Autodesk.Revit.DB.Architecture.RailExtensionStyle.Wall

**中文**: 墙、墙体

The rail extends to wall.